<?php
define("SIGN", "С уважением, Деканат");
define("DATE", "22.09.26");

$events = [
    "expulsion"  => "о вашем отчислении из этого учебного заведения",
    "gratitude" => "благодарность за Ваши успехи в учебе",
    "bonus"   => "премию за участие в олимпиаде",
    "stipend" => "ежемесячную стипендию"
];

$people = [
    "taras" => [
        "name"  => "Тарас",
        "email" => "taras25@gmail.com",
    ],
    "kirill" => [
        "name"  => "Кирилл",
        "email" => "kirillodagoat@gmail.com",
    ],
    "philipp"  => [
        "name" => "Филипп",
        "email" => "afilipp22@gmail.com"
    ],
    "dmitryi"  => [
        "name" => "Дмитрий",
        "email" => "boyko978@gmail.com"
    ],
];

$letter["taras"] = "expulsion";
$letter["kirill"] = "gratitude";
$letter["philipp"]  = "bonus";
$letter["dmitryi"] = "stipend";

// Шаблон письма:
// 22.09.26
// Уважаемый -, перечисляем Вам ежемесячную стипендию/передаем вам невероятную благодарность/начисляем Вам премию/перечисляем вам ежемесячную стипендию за ваши старания.
// Вы невероятно старались в этом месяце, поэтому директор нашего университета лично выражает вам большое спапибо.
// С уважением, Деканат.
